In [1]:
from sqlalchemy import create_engine
import pandas as pd
import configparser
import psycopg2

In [2]:
# get data from configuration file
config = configparser.ConfigParser()
try:
    config.read('ETLDemo.ini')
except Exception as e:
    print('could not read configuration file:' + str(e))
    sys.exit()

In [3]:
# read settings from configuration file
server = config['CONFIG']['server']
database = config['CONFIG']['database']
user = config['CONFIG']['user']
password = config['CONFIG']['password']

In [4]:
#engine = create_engine('postgresql://test_user1:abc123@localhost:5432/test_db1')
engine = create_engine('postgresql://' + user + ':' + password + '@' + server + ':5432/' + database)

In [39]:
test_cases_df = pd.read_csv('test_cases.csv')

In [40]:
test_cases_df

,trans_key,Field_1,Field_2,Field_3,Result_value,Query
0,101,100.0,45.0,72.0,237.00,select result_value from dummy_results where t...
1,102,200.0,20.0,41.0,443.50,select result_value from dummy_results where t...
2,105,333.2,55.6,88.9,123.80,select result_value from dummy_results where t...
3,106,111.0,444.0,333.0,888.00,select result_value from dummy_results where t...
4,200,233.0,553.0,436.0,783.00,select result_value from dummy_results2 where ...
5,222,437.0,889.0,554.0,453.65,select result_value from dummy_results2 where ...
6,245,332.0,436.0,663.0,576.89,select result_value from dummy_results2 where ...

In [41]:
test_cases_df = test_cases_df.set_index('trans_key')
test_cases_df

,Field_1,Field_2,Field_3,Result_value,Query
trans_key,,,,,
101,100.0,45.0,72.0,237.00,select result_value from dummy_results where t...
102,200.0,20.0,41.0,443.50,select result_value from dummy_results where t...
105,333.2,55.6,88.9,123.80,select result_value from dummy_results where t...
106,111.0,444.0,333.0,888.00,select result_value from dummy_results where t...
200,233.0,553.0,436.0,783.00,select result_value from dummy_results2 where ...
222,437.0,889.0,554.0,453.65,select result_value from dummy_results2 where ...
245,332.0,436.0,663.0,576.89,select result_value from dummy_results2 where ...

In [42]:
test_cases_df['Query']

trans_key
101    select result_value from dummy_results where t...
102    select result_value from dummy_results where t...
105    select result_value from dummy_results where t...
106    select result_value from dummy_results where t...
200    select result_value from dummy_results2 where ...
222    select result_value from dummy_results2 where ...
245    select result_value from dummy_results2 where ...
Name: Query, dtype: object

In [43]:
db_result_df = pd.DataFrame(columns = ['Key', 'computed_value'])

In [10]:
# Connect to PostgreSQL server
dbConnection    = engine.connect();

In [44]:
for ind in test_cases_df.index:
    query_df = pd.read_sql(test_cases_df.loc[ind, 'Query'], dbConnection);
    
    if (len(query_df.index) != 0):
        
        db_result_df = db_result_df.append({'Key': ind, 'computed_value': query_df['result_value'].values[0]}, ignore_index = True)
        #test_cases_df.loc[ind, 'computed_value'] = query_df['result_value']
        print(query_df['result_value'].values[0])
    else:
        print("DF is Empty !!!")

237.0
123.45
DF is Empty !!!
DF is Empty !!!
783.0
453.65
664.0

In [45]:
db_result_df

     Key  computed_value
0  101.0          237.00
1  102.0          123.45
2  200.0          783.00
3  222.0          453.65
4  245.0          664.00

In [46]:
db_result_df = db_result_df.set_index('Key')
db_result_df

       computed_value
Key
101.0          237.00
102.0          123.45
200.0          783.00
222.0          453.65
245.0          664.00

In [47]:
combined_df = pd.concat([test_cases_df, db_result_df], axis=1)

In [48]:
combined_df

,Field_1,Field_2,Field_3,Result_value,Query,computed_value
101.0,100.0,45.0,72.0,237.00,select result_value from dummy_results where t...,237.00
102.0,200.0,20.0,41.0,443.50,select result_value from dummy_results where t...,123.45
105.0,333.2,55.6,88.9,123.80,select result_value from dummy_results where t...,NaN
106.0,111.0,444.0,333.0,888.00,select result_value from dummy_results where t...,NaN
200.0,233.0,553.0,436.0,783.00,select result_value from dummy_results2 where ...,783.00
222.0,437.0,889.0,554.0,453.65,select result_value from dummy_results2 where ...,453.65
245.0,332.0,436.0,663.0,576.89,select result_value from dummy_results2 where ...,664.00

In [51]:
test_cases_df = test_cases_df.join(db_result_df)

In [52]:
test_cases_df

,Field_1,Field_2,Field_3,Result_value,Query,computed_value
trans_key,,,,,,
101,100.0,45.0,72.0,237.00,select result_value from dummy_results where t...,237.00
102,200.0,20.0,41.0,443.50,select result_value from dummy_results where t...,123.45
105,333.2,55.6,88.9,123.80,select result_value from dummy_results where t...,NaN
106,111.0,444.0,333.0,888.00,select result_value from dummy_results where t...,NaN
200,233.0,553.0,436.0,783.00,select result_value from dummy_results2 where ...,783.00
222,437.0,889.0,554.0,453.65,select result_value from dummy_results2 where ...,453.65
245,332.0,436.0,663.0,576.89,select result_value from dummy_results2 where ...,664.00

In [53]:
import numpy as np
test_cases_df['Pass_Fail'] = np.where(test_cases_df['Result_value'] == test_cases_df['computed_value'], 'Pass', 'Fail')

In [54]:
test_cases_df

,Field_1,Field_2,Field_3,Result_value,Query,computed_value,Pass_Fail
trans_key,,,,,,,
101,100.0,45.0,72.0,237.00,select result_value from dummy_results where t...,237.00,Pass
102,200.0,20.0,41.0,443.50,select result_value from dummy_results where t...,123.45,Fail
105,333.2,55.6,88.9,123.80,select result_value from dummy_results where t...,NaN,Fail
106,111.0,444.0,333.0,888.00,select result_value from dummy_results where t...,NaN,Fail
200,233.0,553.0,436.0,783.00,select result_value from dummy_results2 where ...,783.00,Pass
222,437.0,889.0,554.0,453.65,select result_value from dummy_results2 where ...,453.65,Pass
245,332.0,436.0,663.0,576.89,select result_value from dummy_results2 where ...,664.00,Fail